x = 1.00001;
x;
1.1;
1;
1e10;
.1;
0000000;
x + 1;
y = 1.1;
-2^3;
+x^y;
-x^y;
-x^(y+1);
-x^y+1;
-1*x^y;
-1+x^y;
v=0;
-1+(v+1)^(y+1);
2^3^4;
a = 2;
b = 3;
c = 4;
a/b/c;
y < y;
clock();
assert(y <= y);
f = \x -> { x^2; };;
f(10.0)^f(10.0);

f;
f2 = \x y -> (x^2 + y^2);;
f2;
"";

"🎁 🐪 𝕭𝖔𝖎𝖑𝖊𝖗⸗𝖕𝖑𝖆𝖙𝖊 𝖋𝖔𝖗 𝖀𝖓𝖎𝖈𝖔𝖉𝖊⸗𝕬𝖜𝖆𝖗𝖊 𝕮𝖔𝖉𝖊 🐪 🎁";
f(x)^f2(x);
{ x = 1; };;
\x -> {
        y;
};;
\x -> y;;

cond = ((1 > 2) ? x : y)
assert(cond == y)

// "x" + "y"

asdf = 1 + 2
asdf

assert(asdf == 3)

# more comments

asdf

